In [2]:
import pandas as pd

In [17]:
df_activity = pd.read_csv("3_clean_datasets/activity_id.csv")
df_sex = pd.read_csv("3_clean_datasets/sex_id.csv")
df_studies = pd.read_csv("3_clean_datasets/studies_id.csv")
df_visa_type = pd.read_csv("3_clean_datasets/visa_type.csv")
df_comunas = pd.read_csv("3_clean_datasets/comunas_data.csv")
df_visas = pd.read_csv("3_clean_datasets/visas.csv")

In [18]:
df_visas.shape
df_comunas.shape

(348, 6)

In [19]:
df_comunas.head()

,region_id,region_name,comuna_datachile_id,comuna_customs_id,comuna_tax_office_id,comuna_name
0,1,Tarapacá,226,1401.0,1204.0,Pozo Almonte
1,1,Tarapacá,217,1405.0,1203.0,Pica
2,1,Tarapacá,113,1101.0,1201.0,Iquique
3,1,Tarapacá,108,1404.0,1206.0,Huara
4,1,Tarapacá,58,1403.0,1210.0,Colchane

In [16]:
df_comunas.head()

   comuna_datachile_id   comuna_name
0                  226  Pozo Almonte
1                  217          Pica
2                  113       Iquique
3                  108         Huara
4                   58      Colchane

In [8]:
df_visas.head()

,year,sex_id,birth_date,age,activity_id,studies_id,comuna_datachile_id,region_id,country_name,es_country_name,country_code,iso3,region,region_code,sub_region,sub_region_code,visa_type_id
0,2005,1,1984-01-17,21,2,0,290,13,Peru,Perú,219,PER,Americas,19,South America,5,1
1,2005,1,1970-07-11,35,2,5,228,13,Bolivia,Bolivia,221,BOL,Americas,19,South America,5,1
2,2005,2,1983-01-18,22,2,0,228,13,Ecuador,Ecuador,218,ECU,Americas,19,South America,5,1
3,2005,2,1984-03-15,21,5,0,134,13,Morocco,Marruecos,128,MAR,Africa,2,Northern Africa,15,1
4,2005,1,1975-08-07,30,5,0,314,9,China,China,336,CHN,Asia,142,Eastern Asia,30,1